In [1]:
import pandas as pd
import numpy as np

In [2]:
data =  {'eng':[10,30,50,70,60],
         'kor':[20,40,60,80,75],
         'math':[90,50,20,70,30]}
df = pd.DataFrame(data, index=['a','b','c','d','e'] )
df

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20
d   70   80    70
e   60   75    30

디폴트
- axis = None --> 0
- axis = 0 (컬럼별)
- axis = 1 (행별(index))

In [3]:
df.sum() #시리즈 객체 .함수

eng     220
kor     275
math    260
dtype: int64

In [4]:
df.sum(axis=1)

a    120
b    120
c    130
d    220
e    165
dtype: int64

In [5]:
### 전체 총합
df.sum().sum()

np.int64(755)

In [6]:
df.values.sum() #df.values --> numpy array로 출력

np.int64(755)

In [7]:
df.stack() # 1차원 시리즈로 출력

a  eng     10
   kor     20
   math    90
b  eng     30
   kor     40
   math    50
c  eng     50
   kor     60
   math    20
d  eng     70
   kor     80
   math    70
e  eng     60
   kor     75
   math    30
dtype: int64

In [8]:
df.stack().sum() # df.stack() 1차원 시리즈로 출력

np.int64(755)

In [9]:
df.mean()

eng     44.0
kor     55.0
math    52.0
dtype: float64

In [10]:
df.mean(axis=1).round(2)

a    40.00
b    40.00
c    43.33
d    73.33
e    55.00
dtype: float64

In [11]:
df.max()

eng     70
kor     80
math    90
dtype: int64

In [12]:
df.max(axis=1)

a    90
b    50
c    60
d    80
e    75
dtype: int64

In [13]:
df.min()

eng     10
kor     20
math    20
dtype: int64

In [14]:
df.min(axis=1)

a    10
b    30
c    20
d    70
e    30
dtype: int64

In [15]:
df.idxmax()

eng     d
kor     d
math    a
dtype: object

In [16]:
df.idxmin()

eng     a
kor     a
math    c
dtype: object

In [17]:
df.median()

eng     50.0
kor     60.0
math    50.0
dtype: float64

In [18]:
df.median(axis=1)

a    20.0
b    40.0
c    50.0
d    70.0
e    60.0
dtype: float64

In [19]:
np.median( df.values ) #전체의 중앙값

np.float64(50.0)

In [20]:
df.stack().median()

np.float64(50.0)

In [21]:
df.std()

eng     24.083189
kor     25.000000
math    28.635642
dtype: float64

In [22]:
df.quantile([0.25,0.5,0.75])

       eng   kor  math
0.25  30.0  40.0  30.0
0.50  50.0  60.0  50.0
0.75  60.0  75.0  70.0

In [23]:
df.count() #nan 데이터 포함 X

eng     5
kor     5
math    5
dtype: int64

In [24]:
df.describe() # 각 컬럼별 기술 통계 값 보여주기

             eng   kor       math
count   5.000000   5.0   5.000000
mean   44.000000  55.0  52.000000
std    24.083189  25.0  28.635642
min    10.000000  20.0  20.000000
25%    30.000000  40.0  30.000000
50%    50.000000  60.0  50.000000
75%    60.000000  75.0  70.000000
max    70.000000  80.0  90.000000

In [25]:
df.head(2) #먼저 선언된 값 가져오기

   eng  kor  math
a   10   20    90
b   30   40    50

In [26]:
df.tail(2) # 마지막에 선언된 값 가져오기

   eng  kor  math
d   70   80    70
e   60   75    30

In [27]:
# top 구하기
df.nlargest(2, 'math', keep='all') # 컬럼 값을 지정해줘야함

   eng  kor  math
a   10   20    90
d   70   80    70

In [28]:
mydf = pd.DataFrame( {'price':[100,120,150,300]} )
mydf

   price
0    100
1    120
2    150
3    300

In [29]:
mydf.diff() #증감치

   price
0    NaN
1   20.0
2   30.0
3  150.0

In [30]:
mydf.pct_change() # 변화율(%)

   price
0    NaN
1   0.20
2   0.25
3   1.00

### 조건별
- apply

In [31]:
def fn (v):
    print( 'v=>', v ) #v= 컬럼별 시리즈
    print('='*30)
    return v.sum()

In [32]:
df.apply(fn) # 각 컬럼별 총합

v=> a    10
b    30
c    50
d    70
e    60
Name: eng, dtype: int64
==============================
v=> a    20
b    40
c    60
d    80
e    75
Name: kor, dtype: int64
==============================
v=> a    90
b    50
c    20
d    70
e    30
Name: math, dtype: int64
==============================

eng     220
kor     275
math    260
dtype: int64

In [33]:
df.apply(fn, axis=1) # 행별 총합

v=> eng     10
kor     20
math    90
Name: a, dtype: int64
==============================
v=> eng     30
kor     40
math    50
Name: b, dtype: int64
==============================
v=> eng     50
kor     60
math    20
Name: c, dtype: int64
==============================
v=> eng     70
kor     80
math    70
Name: d, dtype: int64
==============================
v=> eng     60
kor     75
math    30
Name: e, dtype: int64
==============================

a    120
b    120
c    130
d    220
e    165
dtype: int64

In [34]:
df.apply(lambda v: v.sum())

eng     220
kor     275
math    260
dtype: int64

In [35]:
df.apply(lambda v: v.sum(), axis=1)

a    120
b    120
c    130
d    220
e    165
dtype: int64

In [36]:
df.apply(lambda v: '합격' if v.mean()>=70 else '불합격', axis=1)

a    불합격
b    불합격
c    불합격
d     합격
e    불합격
dtype: object

In [37]:
# 국어,영어, 수학 점수의 평균이 70점 이상이면 
# '합격' 아니면 '불합격' 으로 결과를 출력하시오
df['결과'] = df.apply(lambda v: '합격' if v.mean()>=70 else '불합격', axis=1)

In [38]:
df

   eng  kor  math   결과
a   10   20    90  불합격
b   30   40    50  불합격
c   50   60    20  불합격
d   70   80    70   합격
e   60   75    30  불합격